
<!DOCTYPE HTML>
<html lang="es" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>UNIDAD 2- FUNCIONES DEL COORDINADOR DE FORMACIÓN · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-accordion/accordion.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-image-captions/image-captions.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-styled-blockquotes/plugin-styled-blockquotes.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-githubcontributors/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="unidad_3-_coordinacion_con_la_red_del_profesorado_.html" />
    
    
    <link rel="prev" href="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Escribe para buscar" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    M5 COFO. EL CENTRO EDUCATIVO Y LA FORMACIÓN DEL PROFESORADO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduccion.html">
            
                <a href="introduccion.html">
            
                    
                    INTRODUCCIÓN
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="unidad_1-_organizacion_y_funcionamiento_de_un_cent/">
            
                <a href="unidad_1-_organizacion_y_funcionamiento_de_un_cent/">
            
                    
                    UNIDAD 1- ORGANIZACIÓN Y FUNCIONAMIENTO DE UN CENTRO EDUCATIVO: ¿QUÉ LUGAR OCUPA LA FORMACIÓN DEL PROFESORADO Y SU COORDINADOR?
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_planes_de_formacion_de_centro.html">
            
                <a href="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_planes_de_formacion_de_centro.html">
            
                    
                    LOS PLANES DE FORMACIÓN DE CENTRO:
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.html">
            
                <a href="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.html">
            
                    
                    LOS COORDINADORES DE FORMACIÓN DE LOS CENTROS:
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="unidad_2-_funciones_del_coordinador_de_formacion.html">
            
                <a href="unidad_2-_funciones_del_coordinador_de_formacion.html">
            
                    
                    UNIDAD 2- FUNCIONES DEL COORDINADOR DE FORMACIÓN
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="unidad_3-_coordinacion_con_la_red_del_profesorado_.html">
            
                <a href="unidad_3-_coordinacion_con_la_red_del_profesorado_.html">
            
                    
                    UNIDAD 3- COORDINACIÓN CON LA RED DEL PROFESORADO Y CON OTROS SUJETOS E INSTITUCIONES QUE INTERVIENEN EN EL CENTRO EDUCATIVO
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="unidad_4-_planes_de_formacion_en_centros.html">
            
                <a href="unidad_4-_planes_de_formacion_en_centros.html">
            
                    
                    UNIDAD 4- PLANES DE FORMACIÓN EN CENTROS
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="creditos.html">
            
                <a href="creditos.html">
            
                    
                    Créditos
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Publicado con GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >UNIDAD 2- FUNCIONES DEL COORDINADOR DE FORMACIÓN</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="unidad-2-funciones-del-coordinador-de-formaci-n">UNIDAD 2- FUNCIONES DEL COORDINADOR DE FORMACI&#xD3;N </h1>
<p>Las funciones que el <a href="http://www.boa.aragon.es/cgi-bin/EBOA/BRSCGI?CMD=VEROBJ&amp;MLKOB=1040620063232&amp;type=pdf" target="_blank">Decreto de Formaci&#xF3;n vigente</a> asigna al Coordinador de Formaci&#xF3;n son las siguientes:</p>
<ol>
<li>Recoger las necesidades de formaci&#xF3;n detectadas en el centro y trasladarlas a la Red
de Formaci&#xF3;n, en concreto al asesor o asesora de formaci&#xF3;n de su Centro de Profesorado de referencia.</li>
<li>Colaborar con el Equipo Directivo y el Centro de Profesorado en la planificaci&#xF3;n, organizaci&#xF3;n y realizaci&#xF3;n de las actividades de formaci&#xF3;n en el propio centro, as&#xED; como en la elaboraci&#xF3;n del Plan de Formaci&#xF3;n del centro.</li>
<li>Liderar los procesos de formaci&#xF3;n del profesorado contribuyendo a la creaci&#xF3;n de un
clima de colaboraci&#xF3;n y participaci&#xF3;n.</li>
<li>Participar de forma activa y proactiva en la realizaci&#xF3;n de los proyectos educativos en los que participe el centro educativo.</li>
<li>Promover la participaci&#xF3;n del profesorado en el intercambio de experiencias, en las
actividades formativas detallas en el Plan de Formaci&#xF3;n del Centro y en otras modalidades formativas, as&#xED; como en la selecci&#xF3;n y elaboraci&#xF3;n de materiales did&#xE1;cticos que contribuyan al avance de la pr&#xE1;ctica docente, con especial menci&#xF3;n al intercambio de informaci&#xF3;n a trav&#xE9;s de las redes sociales y de la formaci&#xF3;n on line.</li>
<li>Gestionar los apoyos demandados por el centro en cuanto a recursos pedag&#xF3;gicos y
did&#xE1;cticos que puedan facilitar los Centros de Profesorado.</li>
<li>Colaborar con el Equipo Directivo en la evaluaci&#xF3;n del Plan de Formaci&#xF3;n del Centro.</li>
<li>Coordinar las pr&#xE1;cticas acad&#xE9;micas externas de los estudiantes universitarios que se
desarrollen en el centro, as&#xED; como los procesos de acompa&#xF1;amiento de Profesorado novel
que se establezcan.</li>
<li>Colaborar con el Centro de Profesorado la realizaci&#xF3;n, seguimiento y evaluaci&#xF3;n de las actividades formativas que se realicen en su centro.</li>
<li>Participar en las actividades formativas organizadas por el Departamento competente
en materia de educaci&#xF3;n no universitaria, dirigidas espec&#xED;ficamente a este colectivo.</li>
<li>Asistir a las reuniones de coordinaci&#xF3;n a las que sea convocado por el Centro de Profesorado.</li>
<li>Formar parte del Consejo de Centro de Profesorado, si fuera propuesto para ello.</li>
</ol>
<p><img src="images/image6.png" alt=""></p>
<p>Adem&#xE1;s de &#xE9;stas, en los <strong>Institutos de Educaci&#xF3;n Secundaria</strong> los Departamentos de innovaci&#xF3;n y formaci&#xF3;n educativa tendr&#xE1;n las siguientes:</p>
<p>a) Recopilar las propuestas de innovaci&#xF3;n y formaci&#xF3;n de la comunidad educativa, de acuerdo con las directrices establecidas por la Comisi&#xF3;n de Coordinaci&#xF3;n Pedag&#xF3;gica.</p>
<p>b) Elaborar el Plan de Innovaci&#xF3;n y Formaci&#xF3;n del Centro y formular propuestas al equipo directivo y al claustro, relativas a la elaboraci&#xF3;n o modificaci&#xF3;n de dicho plan.</p>
<p>c) Contribuir al desarrollo del Plan de Formaci&#xF3;n del Centro en coordinaci&#xF3;n con las acciones llevadas a cabo por el Departamento de Orientaci&#xF3;n y del Plan de Acci&#xF3;n Tutorial.</p>
<p>d) Contribuir al desarrollo de la innovaci&#xF3;n y formaci&#xF3;n psicopedag&#xF3;gica y profesional del profesorado en lo que concierne a su adaptaci&#xF3;n a los cambios surgidos en la did&#xE1;ctica de las materias que imparten, y en especial a la metodolog&#xED;a por competencias.</p>
<p>e) Promover la investigaci&#xF3;n educativa y proponer actividades de perfeccionamiento del profesorado.</p>
<p>f) Asumir, en su caso, docencia en aquellas actividades de formaci&#xF3;n desarrolladas en el Centro a trav&#xE9;s de las modalidades de cursos, seminarios o proyectos de formaci&#xF3;n de centros en las l&#xED;neas prioritarias propuestas en el Plan de Formaci&#xF3;n del Profesorado.</p>
<p>g) Elevar al Equipo Directivo una Memoria sobre la innovaci&#xF3;n y la formaci&#xF3;n al final del curso para su aprobaci&#xF3;n por el Consejo Escolar.  </p>
<p>En los <strong>Centros de Educaci&#xF3;n Infantil y Primaria y Educaci&#xF3;n Especial</strong> las de:</p>
<p>h) Coordinador e impulsor de la Innovaci&#xF3;n Educativa.</p>
<p>En las <strong>convocatorias de Planes de Formaci&#xF3;n y para todos los centros</strong> consta que:</p>
<p>i) Deben sustituir a los Coordinadores de Actividades en cualquier circunstancia que impida el desarrollo de las mismas.</p>
<p>j) Deben coordinar las actividades dentro de la modalidad de Proyectos de Formaci&#xF3;n en Centro.</p>
<p>Finalmente, en el cumplimiento de todas las anteriores y <strong>a efectos pr&#xE1;cticos</strong>, aunque no normativos, los COFOs acaban asumiendo otras funciones, algunas de las cu&#xE1;les, como otras anteriores, se repart&#xED;an entre los miembros del Equipo Directivo hasta hace muy pocos a&#xF1;os. Entre ellas podemos mencionar:</p>
<p>k) Ser el receptor y distribuidor para el Claustro de noticias relacionadas con la Formaci&#xF3;n del Profesorado (actividades de formaci&#xF3;n, informaci&#xF3;n institucional, etc).</p>
<p>l) Cumplir una funci&#xF3;n mediadora entre el Claustro y el Equipo Directivo para temas relacionados con formaci&#xF3;n e innovaci&#xF3;n.</p>
<p>m) Liderar procesos de cambio y potenciar la creaci&#xF3;n de l&#xED;deres intermedios. Implica en la mayor&#xED;a de los casos asumir directamente la coordinaci&#xF3;n de Proyectos de Innovaci&#xF3;n o Investigaci&#xF3;n Educativas que se propongan desde los centros.</p>
<p>n) Ayudar al Equipo Directivo en cada una de las fases de sus planes de mejora.</p>
<p>o) Promover la reflexi&#xF3;n metodol&#xF3;gica.</p>
<p>p) Generar entornos nuevos e innovadores de aprendizaje para el Claustro y animar a los compa&#xF1;eros a establecer pautas para su propio aprendizaje permanente y continuadas mejoras competenciales.  </p>
<p>q) Ayudar a los compa&#xF1;eros coordinadores de actividades en todas sus tareas y obligaciones, tanto como formadores como gestores en DOCEO.
r) Ayudar, si as&#xED; se requiere, a cualquier compa&#xF1;ero del Claustro en la puesta en marcha de iniciativas innovadoras en cualquiera de sus aspectos (desarrollo, documentaci&#xF3;n oficial para programas institucionales, organizaci&#xF3;n en centro, etc).
s) Ejercer la representaci&#xF3;n del centro sobre temas de innovaci&#xF3;n o formaci&#xF3;n cuando se necesita puntualmente un representante del Claustro para actuaciones en el exterior.
t) Ser modelo pr&#xE1;ctico de todo lo que como COFO y Coordinador de Innovaci&#xF3;n se plantea para los compa&#xF1;eros. &#x201C;Teach as you preach&#x201D;, se suele decir en ingl&#xE9;s. Ense&#xF1;a t&#xFA; mismo como dices a los otros que deben hacerlo. F&#xF3;rmate constantemente, innova, lidera.</p>
<p>Una vez listadas todas estas funciones, cabe reflexionar sobre lo siguiente: &#xBF;Deber&#xED;an los COFOs, que adem&#xE1;s son ahora coordinadores de los procesos de innovaci&#xF3;n y mejora, y por lo tanto l&#xED;deres metodol&#xF3;gicos indiscutibles de los centros, ser parte integrante de los Equipos Directivos, o por lo menos recibir otros incentivos que correspondan a todas las responsabilidades, esfuerzo y trabajo que est&#xE1;n asumiendo?</p>
<p>Actualmente, en Arag&#xF3;n los l&#xED;deres de la innovaci&#xF3;n ya no son los Equipos Directivos, como vemos en esta imagen de Pere Marqu&#xE9;s del 2015, sino los COFOs, pues adem&#xE1;s de la Formaci&#xF3;n se les ha transferido esa responsabilidad.</p>
<p><img src="images/image9.jpg" alt=""></p>
<p><div id="page-footer" class="localized-footer"><hr><p><a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank"><img alt="Licencia de Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by-nc-sa/4.0/80x15.png"></a><br><span xmlns:dct="http://purl.org/dc/terms/" property="dct:title">EL CENTRO EDUCATIVO Y LA FORMACI&#xD3;N DEL PROFESORADO</span> por <span xmlns:cc="http://creativecommons.org/ns#" property="cc:attributionName"><a href="https://catedu.github.io/m5-cofo-el-centro-educativo-y-la-formacion-del-pr/creditos.html" target="_blank">varios autores</a></span> bajo licencia <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">Creative Commons Reconocimiento-NoComercial-CompartirIgual 4.0 Internacional License</a>.</p>
</div></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.html" class="navigation navigation-prev " aria-label="Previous page: LOS COORDINADORES DE FORMACIÓN DE LOS CENTROS:">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="unidad_3-_coordinacion_con_la_red_del_profesorado_.html" class="navigation navigation-next " aria-label="Next page: UNIDAD 3- COORDINACIÓN CON LA RED DEL PROFESORADO Y CON OTROS SUJETOS E INSTITUCIONES QUE INTERVIENEN EN EL CENTRO EDUCATIVO">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"UNIDAD 2- FUNCIONES DEL COORDINADOR DE FORMACIÓN","level":"1.4","depth":1,"next":{"title":"UNIDAD 3- COORDINACIÓN CON LA RED DEL PROFESORADO Y CON OTROS SUJETOS E INSTITUCIONES QUE INTERVIENEN EN EL CENTRO EDUCATIVO","level":"1.5","depth":1,"path":"unidad_3-_coordinacion_con_la_red_del_profesorado_.md","ref":"unidad_3-_coordinacion_con_la_red_del_profesorado_.md","articles":[]},"previous":{"title":"LOS COORDINADORES DE FORMACIÓN DE LOS CENTROS:","level":"1.3.2","depth":2,"path":"unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.md","ref":"unidad_1-_organizacion_y_funcionamiento_de_un_cent/los_coordinadores_de_formacion_de_los_centros.md","articles":[]},"dir":"ltr"},"config":{"plugins":["youtube","accordion","image-captions","styled-blockquotes","localized-footer","edit-link","githubcontributors","ga"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"youtube":{},"accordion":{},"search":{},"styled-blockquotes":{},"localized-footer":{"filename":"./FOOTER.md","hline":true},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"ga":{"configuration":"auto","token":"UA-135691041-2"},"githubcontributors":{"contributorWidth":"300px","githubOwner":"catedu","githubRepository":"m5-cofo-el-centro-educativo-y-la-formacion-del-pr"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"edit-link":{"label":"Edita esta página","base":"https://github.com/catedu/m5-cofo-el-centro-educativo-y-la-formacion-del-pr/edit/master"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"image-captions":{"caption":"Imagen - _CAPTION_","variable_name":"_pictures"}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{"title":"EL CENTRO EDUCATIVO Y LA FORMACIÓN DEL PROFESORADO","author":"Teresa Fernández de la Vega","collaborators":[{"name":"","edited":""}],"_pictures":[]},"language":"es","gitbook":"*"},"file":{"path":"unidad_2-_funciones_del_coordinador_de_formacion.md","mtime":"2021-02-21T10:17:13.354Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-21T10:17:51.101Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-accordion/accordionSelector.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-edit-link/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-githubcontributors/contributors.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

